{
  "source": "https://www.boredpanda.com/anime-quotes/",
  "retrieved_at": "2025-10-24",
  "quotes": [
    "“Being alone is better than being with the wrong person.” — L Lawliet, Death Note",
    "“People’s lives don’t end when they die, it ends when they lose faith.” - Itachi Uchiha, Naruto",
    "“Remember that everyone you meet is afraid of something, loves something and has lost something.” - Lucy Heartfilia, Fairy Tail",
    "“If you don’t like your destiny, don’t accept it. Instead, have the courage to change it the way you want it to be.” — Naruto Uzumaki, Naruto",
    "“It’s more important to master the cards you’re holding than to complain about the ones your opponent was dealt.” - Grimsley, Pokemon",
    "“Hard work is worthless for those that don’t believe in themselves.” - Naruto Uzumaki, Naruto",
    "“The loneliest people are the kindest. The saddest people smile the brightest. The most damaged people are the wisest. All because they don’t wish to see anyone else suffer the way they did.” - Jellal Fernandes, Fairy Tail",
    "“A person grows up when he’s able to overcome hardships. Protection is important, but there are some things that a person must learn on his own.” — Jiraiya, Naruto",
    "“A dropout will beat a genius through hard work.” - Rock Lee, Naruto",
    "“People become stronger because they have memories they can’t forget.” - Tsunade, Naruto",
    "“If you can’t find a reason to fight, then you shouldn’t be fighting.” - Akame, Akame Ga Kill",
    "“Human strength lies in the ability to change yourself.” — Saitama, One-Punch Man",
    "“If you can’t do something, then don’t. Focus on what you can do.” - Shiroe, Log Horizon",
    "“Sometimes I do feel like I’m a failure. Like there’s no hope for me. But even so, I’m not gonna give up. Ever!” - Izuku Midoriya, My Hero Academia",
    "“Knowledge and awareness are vague, and perhaps better called illusions. Everyone lives within their own subjective interpretation.\" - Itachi Uchiha, Naruto",
    "“You need to accept the fact that you’re not the best and have all the will to strive to be better than anyone you face.” — Roronoa Zoro, One Piece",
    "“Hatred and Sorrow are power. They are yours to control. All you have to do is to turn them into strength and use that strength to move forward.“ - Sebastian Michaelis, Black Butler",
    "“Never trust anyone too much, remember the devil was once an angel” - Kaneki, Tokyo Ghoul",
    "“Thinking you’re no-good and worthless is the worst thing you can do.” - Nobito, Doraemon",
    "“I’ll leave tomorrow’s problems to tomorrow’s me.” - Saitama, One-Punch Man",
    "“Being weak is nothing to be ashamed of… Staying weak is!” — Fuegoleon Vermillion, Black Clover",
    "“Fools who don’t respect the past are likely to repeat it.” - Nico Robin, One Piece",
    "“Moving on doesn’t mean you forget about things. It just means you have to accept what’s happened and continue living.” — Erza Scarlet, Fairy Tail",
    "\"When people make a mistake, it is nice to give them advice, but… If they don’t listen, just leave them alone. Otherwise, you’ll do yourself a disservice by wasting your time and effort.\" - Ran Mouri, Detective Conan",
    "“If you feel yourself hitting up against your limit, remember for what cause you clench your fists! Remember why you started down this path, and let that memory carry you beyond your limit.” - All Might, My Hero Academia",
    "\"Religion, ideology, resources, land, spite, love or just because… No matter how pathetic the reason, it’s enough to start war. War will never cease to exist… Reasons can be thought up after the fact… Human nature pursues strife.\" - Pain/Nagato, Naruto Shippuden",
    "“Giving up kills people. When people reject giving up… They finally win the right to transcend humanity.” — Alucard, Hellsing",
    "“A lesson without pain is meaningless. That’s because no one can gain without sacrificing something. But by enduring that pain and overcoming it, he shall obtain a powerful, unmatched heart.” - Edward Elric, Fullmetal Alchemist: Brotherhood",
    "“I don’t care if no one likes me, I wasn’t created in this world to entertain everyone.” - Houtarou Oreki, Hyouka",
    "\"The world isn't perfect. But it's there for us, doing the best it can.... That's what makes it so damn beautiful.\" - Roy Mustang, Full Metal Alchemist",
    "\"Because people don't have wings, we look for ways to fly.\" - Coach Ukai, Haikyuu!",
    "“If you don’t share someone’s pain, you can never understand them.” - Pain/Nagato, Naruto Shippuden",
    "“Being lonely is more painful then getting hurt.” - Monkey D. Luffy, One Piece",
    "“The world is cruel, but also very beautiful.” — Mikasa Ackerman, Attack On Titan",
    "“Reject common sense to make the impossible possible.” - Simon, Tengen Toppa Gurren Lagann",
    "“Who decides limits? And based on what? You said you worked hard? Well, maybe you need to work a little harder. Is that really the limit of your strength? Could you of tomorrow beat you today? Instead of giving in, move forward.” — Saitama, One Punch Man",
    "\"To know sorrow is not terrifying. What is terrifying is to know you can't go back to happiness you could have.\" - Matsumoto Rangiku, Bleach",
    "“Life and death are like light and shadow. They’re both always there. But people don’t like thinking about death, so subconsciously, they always look away from it.” - Yato, Noragami",
    "“Life is like a pencil that will surely run out, but will leave the beautiful writing of life.” — Nami, One Piece",
    "\"When the world shoves you around, you just gotta stand up and shove back. It’s not like somebody’s gonna save you if you start babbling excuses.\" - Roronoa Zoro, One Piece",
    "“As long as you laugh at people’s suffering, your goal will always be out of reach. If you never want to be defeated, you must first learn your own weakness, and always be kind.” - Erza Scarlet, Fairy Tail",
    "“How can you destroy a monster without becoming one?” — Kaneki, Tokyo Ghoul",
    "\"Always believe in yourself. Do this and no matter where you are, you will have nothing to fear.\" - Baron, The Cat Returns",
    "\"Fear is not evil. It tells you what your weakness is. And once you know your weakness, you can become stronger, as well as kinder.\" - Gildarts Clive, Fairy Tail",
    "“If you keep on hiding your true feelings, who is going to be happy? If you are sad, you should say it out loud!” - Haruhi Fujioka, Ouran High School Host Club",
    "“Power comes in response to a need, not a desire. You have to create that need.” - Goku, Dragon Ball Z",
    "“You’ll only realize that you truly love someone if they already caused you enormous pain. Your enemies can never hurt you the way your loved ones can. It’s the people close to your heart that can give you the most piercing wound. Love is a double-edged sword, it can heal the wound faster or it can sink the blade even deeper.” - Himura Kenshin, Rurouni Kenshin",
    "“Revenge is just the path you took to escape your suffering.” — Ichigo Kurosaki, Bleach",
    "\"Life isn’t just doing things for yourself. It’s possible to live in such a way that other people’s happiness, makes you happy too.\" - Asuna Yuuki, Sword Art Online",
    "“Stop pitying yourself. Pity yourself, and life becomes an endless nightmare.” - Osamu Dazai, Bungo Stray Dogs",
    "“No matter how hard or impossible it is, never lose sight of your goal.” - Monkey D Luffy, One Piece",
    "“Helping other people is the best way to make up for your mistakes.” — Kenshin Himura, Rurouni Kenshin",
    "\"We shouldn’t blame ourselves for bad things that happened to us. Sometimes, no matter what we do, we are victims of the circumstances.\" - Kenshin Himura, Rurouni Kenshin",
    "“It will do no good to fight with hate in your heart.” - Yugi Muto, Yu-Gi-Oh!",
    "“When do you think people die? When they are shot through the heart by the bullet of a pistol? No. When they are ravaged by an incurable disease? No. When they drink a soup made from a poisonous mushroom? No! It’s when… They are forgotten.” - Dr. Hiruluk, One Piece",
    "“You focus on the trivial, and lose sight of what is most important, change is impossible in this fog of ignorance.” — Itachi Uchiha, Naruto",
    "“If you don’t take risks, you can’t create a future!” - Monkey D. Luffy, One Piece",
    "“Do you always want to live hiding behind the mask you put up for the sake of others? You’re you, and there’s nothing wrong with that.” — Ymir, Attack On Titan",
    "“Man always thinks about the past before he dies, as if he were frantically searching for proof he truly lived.” - Jet Black, Cowboy Bebop",
    "\"Whether a fish lives in a clear stream or a water ditch, so long as it continues swimming forward, it will grow up beautifully.\" - Koro-Sensei, Assassination Classroom",
    "“I won’t forgive you. I won’t forget you yet, but I’m going to leave you and move on.” - Chise Hatori, The Ancient Magus' Bride",
    "\"Fear is freedom! Subjugation is liberation! Contradiction is truth! Those are the facts of this world! And you will all surrender to them, you pigs in human clothing!\" - Satsuki Kiryuuin, Kill la Kill",
    "“A place where someone still thinks about you is a place you can call home.” — Jiraiya, Naruto",
    "“Life is not a game of luck. If you wanna win, work hard.” - Sora, No Game No Life",
    "\"It may be hard right now… But you must silence those thoughts! Stop counting only those things that you have lost! What is gone, is gone!\" - Jinbei, One Piece",
    "“Words are like swords. If you use them the wrong way, they can turn into ugly weapons.” - Edogawa Conan, Detective Conan",
    "“Stand up and walk. Keep moving forward. You’ve got two good legs. So get up and use them. You’re strong enough to make your own path.” — Edward Elric, Fullmetal Alchemist",
    "“If happiness had a form, what would it look like? It might be something like glass, because one doesn’t notice it normally. However, it is actually there … It will state it’s presence and existence more eloquently than any other thing in this world.” — Lelouch Lamperouge, Code Geass",
    "\"It's funny how each day you wake up and never really know if it will be one that will change your life forever.\" - Shawn, The Secret World Of Arrietty",
    "“Although I’m weak and full of flaws, I will never stop moving forward. No matter who I am, no one other than myself will create my own existence. No matter what others may think or feel, I will still move forward as myself.\" - Oz Vessalius, Pandora Hearts",
    "\"People, who can’t throw something important away, can never hope to change anything.\" - Armin Arlert, Attack on Titan",
    "“Why should I apologize for being a monster? Has anyone ever apologized for turning me into one?” — Juuzou Suzuya, Tokyo Ghoul",
    "“Everything has a beginning and an end. Life is just a cycle of starts and stops. There are ends we don’t desire, but they’re inevitable, we have to face them. It’s what being human is all about.” - Jet Black, Cowboy Bebop",
    "“Sometimes you must hurt in order to know, fall in order to grow, lose in order to gain.” - Pain/Nagato, Naruto Shippuden",
    "\"We are all like fireworks: we climb, we shine and always go our separate ways and become further apart. But even when that time comes, let's not disappear like a firework and continue to shine... Forever.\" - Hitsugaya Toshiro, Bleach",
    "“There’s no shame in falling down! True shame is to not stand up again!” - Shintarō Midorima, Kuroko’s Basketball",
    "“If you really want to be strong… Stop caring about what your surrounding thinks of you!” - Saitama, One-Punch Man",
    "“Vision is not what your eyes see, but an image that your brain comprehends.” — Touko Aozaki, The Garden of Sinners",
    "“If you wanna stop this, then stand up! Because I’ve just got one thing to say to you! Never forget who you want to become!” - Shoto Todoroki, My Hero Academia",
    "“If you want to know who you are, you have to look at your real self and acknowledge what you see.” - Itachi Uchiha, Naruto",
    "\"However strong you become, never seek to bear everything alone. If you do, failure is certain.\" - Itachi Uchiha, Naruto",
    "“Sometimes one must lose the battle in order to win the war.” — Isuzu Sento, Amagi Brilliant Park",
    "“Forgetting is like a wound. The wound may heal, but it has already left a scar.” - Monkey D. Luffy, One Piece",
    "“You can die anytime, but living takes true courage.” - Kenshin Himura, Rurouni Kenshin",
    "“It is at the moment of death that humanity has value.” — Archer, Fate Series",
    "“I refuse to let my fear control me anymore.” - Maka Albarn, Soul Eater",
    "“If nobody cares to accept you and wants you in this world, accept yourself and you will see that you don’t need them and their selfish ideas.” - Alibaba Saluja, Magi",
    "“You can’t win a game by doing nothing. And if someone else wins it for you then you haven’t accomplished anything. Life is the same way.” - Junichirou Kagami, Denpa Kyoushi",
    "“Destiny. Fate. Dreams. These unstoppable ideas are held deep in the heart of man. As long as there are people who seek freedom in this life, these things shall not vanish from the Earth.” — Gold D. Rodger, One Piece",
    "\"Sometimes, we have to look beyond what we want and do what’s best.\" - Piccolo, Dragon Ball Z",
    "“Push through the pain, giving up hurts more.” - Vegeta, Dragon Ball",
    "“It’s foolish to fear what we have yet to see and know.” — Itachi Uchiha, Naruto",
    "\"A life without no changes can’t be called life. You can only call it experience.\" - Lelouch Lamperouge, Code Geass",
    "\"People are all evil. In order to falsely believe yourself to be just, you must inevitably falsely believe that someone else is more evil than you.\" - Orihime Inoue, Bleach",
    "“Life is like a tube of toothpaste. When you’ve used all the toothpaste down to the last squeeze, that’s when you’ve really lived. Live with all your might, and struggle as long as you have life.” - Mion Sonozaki, Higurashi No Naku Koro Ni",
    "“Don’t beg for things. Do it yourself, or else you won’t get anything.” - Renton Thurston, Eureka Seven",
    "“We can’t waste time worrying about the what if’s.” - Ichigo Kurosaki, Bleach",
    "“No matter how many good deeds you perform, your past sins cannot be erased.” - Sheele, Akame Ga Kill",
    "“Teachings that do not speak of pain have no meaning, for humankind cannot gain anything in return.” — Itachi Uchiha, Naruto",
    "\"Knowing you’re different is only the beginning. If you accept these differences, you’ll be able to get past them and grow even closer.\" - Miss Kobayashi, Miss Kobayashi's Dragon Maid",
    "“I want you to be happy. I want you to laugh a lot. I don’t know what exactly I’ll be able to do for you, but I’ll always be by your side.” — Kagome, InuYasha",
    "“Every journey begins with a single step. We just have to have patience.” - Milly Thompson, Trigun",
    "“Whatever you do, enjoy it to the fullest. That is the secret of life.” - Rider, Fate Zero",
    "“Sometimes it’s necessary to do unnecessary things.” - Kanade Jinguuji, Best Student Council",
    "“Protecting someone means giving them a place to belong. Giving them a place where they can be happy.” — Princess Lenessia, Log Horizon",
    "“When you lose sight of your path, listen for the destination in your heart.” - Allen Walker, D.Gray Man",
    "“Don’t be so quick to throw away your life. No matter how disgraceful or embarrassing it may be, you need to keep struggling to find your way out until the very end.” - Clare, Claymore",
    "“Mistakes are not shackles that halt one from stepping forward. Rather, they are that which sustain and grow one’s heart.” - Mavis Vermillion, Fairy Tail",
    "“If you begin to regret, you’ll dull your future decisions and let others make your choices for you. All that’s left for you then is to die. Nobody can foretell the outcome. Each decision you make holds meaning only by affecting your next decision.” — Erwin Smith, Attack on Titan",
    "\"Power is not will, it is the phenomenon of physically making things happen.\" - Madara Uchiha, Naruto Shippuden",
    "“If you want to grant your own wish, then you should clear your own path to it.” - Rintarou Okabe, Steins;Gate",
    "\"It’s meaningless to just live, and it’s meaningless to just fight. I want to win.\" - Ichigo Kurosaki, Bleach",
    "\"Those who cannot acknowledge themselves, will eventually fail.\" - Itachi Uchiha, Naruto",
    "\"People live their lives bound by what they accept as correct and true. That's how they define ‘reality’. But what does it mean to be ‘correct’ or ‘true’? Merely vague concepts... Their ‘reality’ may all be a mirage. Can we consider them to simply be living in their own world, shaped by their beliefs?\" - Itachi Uchiha, Naruto",
    "“When you give up, that’s when the game ends.” - Mitsuyoshi Anzai, Slam Dunk",
    "“It doesn’t do any good to pretend you can’t see what’s going on.” — Yuuya Mochizuki, Another",
    "“There are no regrets. If one can be proud of one’s life, one should not wish for another chance.” - Saber, Fate Stay Night",
    "“It’s not always possible to do what we want to do, but it’s important to believe in something before you actually do it.” - Might Guy, Naruto",
    "\"When people constantly show their affection for you, you start taking it for granted. If you don’t realize how much they care for you until they’re gone, you’ll only be left with regret and remorse.\" - Orihime Inoue, Bleach",
    "\"That’s just the way it is. Change is inevitable. Instead of resisting it, you’re better served simply going with the flow.\" - Shunsui Kyouraku, Bleach",
    "“You have to accept life as it is. Acceptance is the key for surviving the worst situations.” — Takashi, My Neighbors the Yamadas",
    "\"Life is suffering. It is hard. The world is cursed. But still you find reasons to keep living.\" - Lady Eboshi, Princess Mononoke",
    "“How can you move forward if you keep regretting the past?” — Edward Elric, Fullmetal Alchemist: Brotherhood",
    "“Maybe there’s only a dark road up ahead. But you still have to believe and keep going. Believe that the stars will light your path, even a little bit. Come on, let’s go on a journey!” - Kaori Miyazono, Your Lie In April",
    "\"Those who stand at the top determine what's wrong and what's right! This very place is neutral ground! Justice will prevail, you say? But of course it will! Whoever wins this war becomes justice!\" - Don Quixote Doflamingo, One Piece",
    "“Whatever you lose, you’ll find it again. But what you throw away you’ll never get back.” — Kenshin Himura, Rurouni Kenshin: Meiji Kenkaku Romantan",
    "“We don’t have to know what tomorrow holds! That’s why we can live for everything we’re worth today!” - Natsu Dragneel, Fairy Tail",
    "“If you wanna make people dream, you’ve gotta start by believing in that dream yourself!” - Seiya Kanie, Amagi Brilliant Park",
    "“The moment you think of giving up, think of the reason why you held on so long.” — Natsu Dragneel, Fairy Tail",
    "“Do not think about other things, there is only one thing you can do. So master that one thing. Do not forget. What you must imagine is always that you, yourself, are the strongest. You do not need outside enemies. For you, the one you have to fight is none other than your own image.” - Archer, Fate Stay Night",
    "“The only thing we’re allowed to do is believe that we won’t regret the choice we made.” - Levi Ackerman, Attack on Titan",
    "“I have no fear of death. It just means dreaming in silence. A dream that lasts for eternity.” - Vincent Volaju, Cowboy Bebop",
    "“You yourself have to change first, or nothing will change for you.” - Gintoki Sakata, Gintama",
    "“The strong one doesn’t win. The one who wins is strong.” — Shinichi Kudo, Detective Conan",
    "\"It’s easier to crush a dream than realize one. Forming a bond is infinitely more difficult than breaking one.\" - Gin Ichimaru, Bleach",
    "\"All things change in a dynamic environment. Your effort to remain what you are is what limits you.\" - Puppet Master, Ghost In The Shell",
    "“Don’t believe in yourself! Believe in the me who believes in you!” — Kamina, Tengen Toppa Gurren Lagann",
    "\"A different species, a different set of values, a world completely unlike your own. There is a feeling you can only get when you meet the unknown and open your mind.\" - Yoshiyuki Nakajima, Silver Spoon",
    "\"I am the hope of the universe. I am the answer to all living things that cry out for peace. I am protector of the innocent. I am the light in the darkness. I am truth. Ally to good! Nightmare to you!\" - Son Goku, Dragon Ball Z",
    "“Don’t give up, there’s no shame in falling down! True shame is to not stand up again!” — Shintaro Midorima, Kuroko No Basket",
    "“All we can do is live until the day we die. Control what we can… And fly free.” - Deneil Young, Space Brothers",
    "“It’s just pathetic to give up on something before you even give it a shot.” - Reiko Mikami, Another",
    "“If you just submit yourself to fate, then that’s the end of it.” — Keiichi Maebara, Higurashi: When They Cry",
    "“You can’t always hold on to the things that are important. By letting them go we gain something else.” - Kunio Yaobi, Tamako Market",
    "“An excellent leader must be passionate because it’s their duty to keep everyone moving forward.” — Nico Yazawa, Love Live",
    "“Don’t be upset because of what you can’t do. Do what you do best, live as carefree and optimistically as you can, because some people aren’t able to do that.” - Keima Katsuragi, The World God Only Knows",
    "“I too will obtain everything that I desire. Not because someone asked me to do it, but because I know in my heart that I have something worth fighting for.” - Julis Alexia Van Riessfeld, Asterisk War",
    "“I think death is equally terrible for everyone. Young people, old people, the good, the bad; it’s always the same. It’s rather fair in its treatment. There’s no such thing as a particularly terrible death, that’s why it’s frightening.” — Sunako, The Wallflower",
    "\"Justice isn’t something that you can just proclaim. It’s a feeling you should keep near your heart.\" - Miwako Sato, Detective Conan",
    "\"Sometimes the things that matter the most are right in front of you.\" - Yuuki Asuna, Sword Art Online",
    "\"If there is such a thing like happiness in this world, it should resemble the endless nothingness. Nihility is having nothing and having nothing to lose. If that isn’t happiness… Then what is?\" - Ulquiorra Cifer, Bleach",
    "“In this world, there’s no such thing as 'failure' in the first place. The one who knows the 'ways to win' more than anyone is also the one who’s experienced the most 'mistakes'. In other words… You could say 'failure' is equal to 'success'… Couldn’t you?” - Toriko, Toriko",
    "\"I must study lots of things or I won’t become a great person.\" - Kotomi Ichinose, CLANNAD",
    "“The ticket to the future is always open.” - Vash The Stampede, Trigun",
    "“Life comes at a cost. Wouldn’t it be arrogant to die before you’ve repaid that debt?” — Yuuji Kazami, The Fruit of Grisaia",
    "“Anything can happen. No one ever thinks it will until it does. What will happen, happens. That’s how the world is. The most important thing is to not let the tragedy defeat you. To believe that you can get through it.” - Kyousuke Natsume, Little Busters!",
    "“Just like games, no matter how well you have things lined up in your life, there’s always something to keep you on your toes.” - Junichirou Kagami, Denpa Kyoushi",
    "“Do exactly as you like. That is the true meaning of pleasure. Pleasure leads to joy and joy leads to happiness.” - Gilgamesh, Fate Zero",
    "\"You’ll stumble many times in the future, but when you do, each time you’ll have more strength to bounce back.\" - Nobita, Doraemon",
    "“Sometimes, people are just mean. Don’t fight mean with mean. Hold your head high.” — Hinata Miyake, A Place Further than the Universe",
    "“When you hit the point of no return, that’s the moment it truly becomes a journey. If you can still turn back, it’s not really a journey.” - Hinata Miyake, A Place Further than the Universe",
    "\"If you can truly believe in something, then the power of your belief will make it real.\" - Diane Thurston, Eureka Seven",
    "“Once, I wrestled with the difficult question of how one should live as a tanuki. I felt I understood how to live an interesting life, but it was unclear what else I should do. And then somewhere along the line, idling my time away doing nothing, I realized that there’s nothing else I need to do besides live an interesting life.” — Yasaburo Shimogamo, The Eccentric Family",
    "“Simplicity is the easiest path to true beauty.” - Seishuu Handa, Barakamon",
    "“To act is not necessarily compassion. True compassion sometimes comes from inaction.” - Hinata Miyake, A Place Further than the Universe",
    "“If you’re gonna insist on gambling and then complain when you lose, you had better work on your game.” - Hatsu Kominato, Selector Infected Wixoss"
  ]
}